Тест1/src/DataProcessors/ДоходыРасходы/ДоходыРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДоходыРасходы</name>
</mdclass:DataProcessor>

Тест1/src/Documents/ВыводДенегИзРазборки/ВыводДенегИзРазборки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыводДенегИзРазборки</name>
  <registerRecords>AccumulationRegister.ОтданоСМашины</registerRecords>
  <registerRecords>AccumulationRegister.МаратуНаличкой</registerRecords>
  <registerRecords>AccumulationRegister.ВыводС1Января</registerRecords>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>Кому</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Нам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марату</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоОткатов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кто</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Artem</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаратуНаличкой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Таблица</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПродажаЗапчастей</types>
      </type>
    </attributes>
    <attributes>
      <name>нам</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>марату</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>итогсум</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выведено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Artem</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаратуНаличкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест1/src/Catalogs/Машины/Машины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Машины</name>
  <basedOn>Document.ФиксацияЗаказаМашин</basedOn>
  <attributes>
    <name>ВинКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>EnumRef.Производитель</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НПорядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТС</name>
    <type>
      <types>CatalogRef.ТипТС</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаТС</name>
    <type>
      <types>CatalogRef.МодельТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМашины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказаниеОдометраНаНачалоЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрицеп</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМашины</name>
    <type>
      <types>EnumRef.ТипМашинНаРазборке</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКабины</name>
    <type>
      <types>EnumRef.ТипыКабин</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельДвигателя</name>
    <type>
      <types>CatalogRef.МоделиДвигателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Мощность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТопливнаяСистема</name>
    <type>
      <types>EnumRef.ТопливнаяСистема</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>CatalogRef.КПП</types>
    </type>
  </attributes>
  <attributes>
    <name>Редуктор</name>
    <type>
      <types>CatalogRef.Редукторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.Серии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументФиксацииЗаказаМашины</name>
    <type>
      <types>DocumentRef.ФиксацияЗаказаМашин</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>МашинаАгрегат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПартии</name>
    <type>
      <types>CatalogRef.Партии</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкупаемостиАвто</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОкупаемостиВМесяцах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тест1/src/Catalogs/Партии/Партии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Партии</name>
  <attributes>
    <name>СтоимостьМашинВВалюте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьМашинВРублях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПартииВРублях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Таблица</name>
    <attributes>
      <name>Машина</name>
      <type>
        <types>CatalogRef.Машины</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьАвтомобиляВВалюте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставкиПоЕвропеВВалюте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныеРасходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>КурсВалюты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьМашиныВРублях</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НакладныеРасходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЕвро</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьАвтомобиляИтогоРуб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьМашиныВРубляхИтог</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест1/src/DataProcessors/ДоходыРасходы/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьИнфо();
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнфо()
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	             |	Машины.Ссылка,
				 |  Машины.Наименование
	             |ИЗ
	             |	Справочник.Машины КАК Машины" ;
	маш = Запрос.Выполнить().Выгрузить();
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПродажаЗапчастей.Ссылка,
	                |	ПродажаЗапчастей.ВерсияДанных,
	                |	ПродажаЗапчастей.ПометкаУдаления,
	                |	ПродажаЗапчастей.Номер,
	                |	ПродажаЗапчастей.Дата,
	                |	ПродажаЗапчастей.Проведен,
	                |	ПродажаЗапчастей.Клиент,
	                |	ПродажаЗапчастей.Комментарий,
	                |	ПродажаЗапчастей.Доставка,
	                |	ПродажаЗапчастей.Расход,
	                |	ПродажаЗапчастей.СрокПроверки,
	                |	ПродажаЗапчастей.Организация,
	                |	ПродажаЗапчастей.ИтогоРекв,
	                |	ПродажаЗапчастей.КтоПродал,
	                |	ПродажаЗапчастей.Оплачено,
	                |	ПродажаЗапчастей.УжеОплачено,
	                |	ПродажаЗапчастей.Откат,
	                |	ПродажаЗапчастей.КомуОткат,
	                |	ПродажаЗапчастей.ОтданоМарату,
	                |	ПродажаЗапчастей.ИтогоБезнал,
	                |	ПродажаЗапчастей.АртикулВНазвании,
	                |	ПродажаЗапчастей.ВычитатьИзСуммы,
	                |	ПродажаЗапчастей.ПотеряНаОбналичку,
	                |	ПродажаЗапчастей.Таблица.(
	                |		Ссылка,
	                |		НомерСтроки,
	                |		Товар,
	                |		Количество,
	                |		Цена,
	                |		Скидка,
	                |		машина,
	                |		цена1,
	                |		Комментарий,
	                |		Сумма
	                |	),
	                |	ПродажаЗапчастей.Представление,
	                |	ПродажаЗапчастей.МоментВремени
	                |ИЗ
	                |	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
	                |ГДЕ
	                |	ПродажаЗапчастей.Проведен = ИСТИНА" ;
	продажи = Запрос.Выполнить().Выгрузить();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВыводДенегИзРазборки.Ссылка,
	               |	ВыводДенегИзРазборки.ВерсияДанных,
	               |	ВыводДенегИзРазборки.ПометкаУдаления,
	               |	ВыводДенегИзРазборки.Номер,
	               |	ВыводДенегИзРазборки.Дата,
	               |	ВыводДенегИзРазборки.Проведен,
	               |	ВыводДенегИзРазборки.Машина,
	               |	ВыводДенегИзРазборки.Кому,
	               |	ВыводДенегИзРазборки.Сумма,
	               |	ВыводДенегИзРазборки.Нам,
	               |	ВыводДенегИзРазборки.Марату,
	               |	ВыводДенегИзРазборки.ИтогоОткатов,
	               |	ВыводДенегИзРазборки.Таблица.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Документ,
	               |		нам,
	               |		марату,
	               |		Расходы,
	               |		итогсум
	               |	)
	               |ИЗ
	               |	Документ.ВыводДенегИзРазборки КАК ВыводДенегИзРазборки";
	выводы = Запрос.Выполнить().Выгрузить();
	ИтогиВсего =0;
	ИтогиНам=0;
	ИтогиМарату = 0;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Партии.Ссылка,
	               |	Партии.ВерсияДанных,
	               |	Партии.ПометкаУдаления,
	               |	Партии.Предопределенный,
	               |	Партии.Код,
	               |	Партии.Наименование,
	               |	Партии.Таблица.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Машина
	               |	)
	               |ИЗ
	               |	Справочник.Партии КАК Партии";
	партии1 = Запрос.Выполнить().Выгрузить();
	Для Каждого партия3 Из партии1 Цикл
		пвсего = 0;
		пвложено = 0;
		пнам = 0;
		пмарату = 0;
		Для Каждого пм Из партия3.Таблица Цикл
			груз = пм.Машина;
			Всего = 0;
			машин = груз.Ссылка;
			пвложено = пвложено + груз.Сумма;
			Для Каждого прод Из продажи Цикл
				итого = прод.ИтогоРекв;
				расходы = прод.Откат;
				Для Каждого зап Из прод.Таблица Цикл
					Если зап.машина = машин Тогда
						всг = зап.Количество*зап.Цена - зап.Скидка;
						Если расходы > 0 Тогда
							всг = всг - расходы*(всг/итого);
						КонецЕсли;					
						Всего = Всего + всг;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			ИтогоНам = 0;
			ИтогоМарату = 0;
			Для Каждого вывод Из выводы Цикл
				Для Каждого док Из вывод.Таблица Цикл
					итого = док.Документ.ИтогоРекв - док.Документ.Расход;
					марату = док.марату;
					нам = док.нам;
					Для Каждого зап Из док.Документ.Таблица Цикл
						расходы = прод.Откат;
						Если зап.машина = машин И док.Документ.Проведен = ИСТИНА И док.Документ.ОтданоМарату = ИСТИНА Тогда
							всг = зап.Количество*зап.Цена - зап.Скидка;
							Если расходы > 0 Тогда
								всг = всг - расходы*(всг/итого);
							КонецЕсли;
							ИтогоНам = ИтогоНам + всг*нам/итого;
						ИтогоМарату = ИтогоМарату + всг*марату/итого;
						КонецЕсли;
						
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
			стр = машины.Добавить();
			стр.машина = груз.Ссылка;
			стр.всего = Всего;
			стр.марату = ИтогоМарату;
			стр.нам = ИтогоНам;
			ИтогиВсего =ИтогиВсего + Всего;
			пвсего = пвсего + Всего;
			
			пнам = пнам + ИтогоНам;
			пмарату = пмарату + ИтогоМарату;
		ИтогиНам=ИтогиНам+ИтогоНам;
		ИтогиМарату = ИтогиМарату+ИтогоМарату;
	КонецЦикла;
	стр2 = Партии.Добавить();
	стр2.Всего = пвсего;
	стр2.Вложено = пвложено;
	стр2.Нам = пнам;
	стр2.Марату = пмарату;
	КонецЦикла;

КонецПроцедуры
